Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignCode Properties
The AnalysisDesignCode type exposes the following members.
Properties
Name | Description
DesignParameters
 Gets or sets the design parameters of the analysis design code.
ID
 Gets or sets the identifier of the analysis design code.
MaterialType
 Gets the material type of the analysis analysis design code.
Name
 Gets the name of the analysis design code.
Top
See Also
Reference
AnalysisDesignCode Class
Tekla.Structures.Analysis Namespace